const text = `
他人のせいでなく、自分のせいでもなく、もののせいにして生きる：

僕はエンジニアとして現在働いていて、ものづくりをする側の人間です。
いつも生活する上で大切にしているのが、「他人のせいでなく、自分のせいでもなく、もののせいにして生きる」ということです。
それについて、自分の考え方を整理しておきたいなと思ったので、この記事を書きました。

例えば、あなたが毎日入力しなければならない日報を何度も書き忘れて、上司に怒られたとしましょう。そのときに、「ああ、日報を書き忘れてしまう自分はなんてポンコツなんだ、、、。」と自分を攻める人もいるでしょうし、「なんだあの上司は、うるさいなあ。」なんて考える人もいるでしょう。
どちらもなんだかストレスの溜まってしまう考え方ですし、個人的にはあんまり好きではありません。
そんなときには、もののせいにしてみましょう。
「この日報を入力するためのシステムがちゃんとリマインドしてくれないから悪いんだ！」
こういう風に考えると、なんだか誰も悪くない気がしてきます。システムが悪いのであって、誰も悪くない。精神的になんだか健康になれそうな気がします。（一部の賢い人は、そのシステムを作った人が悪いという結論にたどり着いてしまうのでは？と考えるかもしれませんが、それは後ほど回収します。）
さらに、もののせいにすることで、「そのもののどこが悪いのか、どういう風にすればより良くなるのか」を考えることができます。

次は僕の実例を出します。
僕の通っていた高校の図書館の前には、番号4桁で施錠するタイプのロッカーがあり、荷物をどこか空いているところにしまってから図書館に入らなくてはならない決まりがありました。
なので、ロッカーに荷物をしまい、図書館に入ったのですが、いざ帰ろうとした時に、どのロッカーに荷物をいれたか忘れてしまいました！
結局、一個一個図書館の先生と手分けして探してもらい、なんとか荷物を見つけることができました。
このとき、高校生の頃の僕は、「ああ、本当に申し訳ないことをした。ロッカーの場所を覚えておかないなんて、自分はなんてアホなんだ、、、。」と思い、そんなに気にすることではないのですが、その日はなんとなく情けない気持ちになっていました。
今の僕だったら、もちろん、申し訳ない気持ち、感謝の気持ちはその先生に伝えますが、その上で、「これはロッカーが悪い」なんて心の中でそっと思ってしまうでしょう。（なんて傲慢なのか。）そして、情けないなあなんて気持ちもなくなると思います。
ストレスを回避する方法は人それぞれですが、僕はこんな風に「もののせいにする」ということによって、最近はストレスを回避しています。
そして、「じゃあどうやったら解決できるのか？」と考えるようになるため、ものづくりをする立場にいる僕にとっては、この着眼点はとても重要です。

この考え方は、あなたの作ったものに対する批判が来た時にも同様に利用できます。
例えば、あなたがコードレビュー（プログラムを他の人に見てもらい、おかしいところがないか確認してもらうこと）を受けた時に、「お前のこの実装はパフォーマンス的にゴミクソだ」「可読性の低いクソコードだ」などと批判を受けたとしましょう。（ここまで口の悪い人はさすがにあまりいないと信じていますが。）
あなたはもしかしたら、「こんなクソコードを書いてしまった自分もクソみたいな人間なんだ、、、。」と感じてしまうかもしれません。
しかし、「もののせいにする」ということを思い出しましょう。
そのコードレビューを行った人が批判しているのはあくまでその「コード自体」であって、あなた自身を否定しているわけではありません。

もう一つ例をあげましょう。
あなたが学会に行ったとして、「この研究は目的がしっかりしていないのでダメだ。」「この研究に価値はない。」なんてたくさん批判をされたとします。（実際によくあることだと思います。）
しかし、先ほどと同様、これはあなたを批判しているわけではなく、「研究」を批判しているのです。
そういう風に考えれば、なんだか自分は悪くないような気がしてきますし、むしろ研究に前向きになれるのではないのでしょうか。
要するに、自分の書いたコード、自分の行った研究を一旦「他人事」だと思って批判を聞くと良いのです。
そうすれば、精神的にも楽ですし、何よりプロジェクトも前向きに進むような気がします。（回収。）

こんなことを言いましたが、だからといって「このアプリはクソだ。」「あの製品はクソだ。」とかは当然なるべく言わない方が良いです。当たり前ですが、みんながみんなこんな考え方をしているわけではありませんし、暴言は極力避けるべきだと思っています。

さて、ここまでいろんなことを書いてきましたが、「あなたのコードは実に素晴らしい！」「このコードのパフォーマンスは最高だ！」「この研究は着眼点が素晴らしすぎる！」などと言われたとしましょう。
そんなときは、「自分は天才だなあ。」「俺は神だ。」などと思ってしまえば良いと思います。
そして、それに至るまでに協力してくれた方がいたのだとすれば、その方々にも感謝すれば良いと思います。
矛盾するようですが、考え方なんて矛盾していて良いと思います。
自分の都合の良いように考えて、生きていましょう。

以上、「他人のせいでなく、自分のせいでもなく、もののせいにして生きる」でした。
最後まで読んでいただきありがとうございました。
`.replace(/\s+/g, "");

function outputWrappedText() {
  const lengthPerLine = calcLengthPerLine();
  const wrappedText = wrapTextReverse(text, lengthPerLine);
  document.getElementById('output').innerHTML = wrappedText;
}

document.addEventListener('DOMContentLoaded', outputWrappedText);
window.addEventListener('resize', outputWrappedText);

function calcLengthPerLine() {
  const width = window.innerWidth;
  return Math.max(1, Math.floor(width / 20)); 
}

function wrapTextReverse(text, lengthPerLine) {
  let result = '';

  for (let currentLength = 0; currentLength < text.length; currentLength += lengthPerLine) {
    const lineIndex = currentLength / lengthPerLine;

    let line = text.slice(currentLength, currentLength + lengthPerLine).split('');
    if (lineIndex % 2 === 1) { line = line.reverse(); }
    result += line.join('') + '<br />';
  }

  return result;
}
